/*==============================================================================

	背景の制御[bg.cpp]

													Author : トウ ミンヨウ
													Date   :

==============================================================================*/
#include "Main.h"
#include "texture.h"
#include "Sprite.h"
#include "camera.h"
#include "bg.h"
#include "map.h"

/*-----------------------------------------------------------------------------------------
  グローバル変数
 -------------------------------------------------------------------------------------------*/
static int g_TextureBG;

/*-----------------------------------------------------------------------------------------
 関数定義
-------------------------------------------------------------------------------------------*/
void InitBG(void)
{

	g_TextureBG = Texture_SetTextureLoadFile("asset/BG.png");	//背景画像

}


void UninitBG(void)
{

	Texture_Release(&g_TextureBG, 1);

}


void DrawBG(void)
{

	// スプライトを描画
	Sprite_Draw(g_TextureBG, 0.0f, 0.0f, STAGE_WIDTH, STAGE_HEIGHT,
		0, 0, 1440, 960);

}