/*=======================================================================================

	 keyの制御[key.h]
												author:トウ ミンヨウ
												date:
 -----------------------------------------------------------------------------------------

 =========================================================================================*/
#pragma once
#include <d3dx9.h>
#include "collision.h"

/*-----------------------------------------------------------------------------------------
   構造体宣言
-------------------------------------------------------------------------------------------*/
typedef struct {

	bool  use;
	bool  InPlayer;
	D3DXVECTOR2 xy;

} Key;

 /*-----------------------------------------------------------------------------------------
   定数宣言
  -------------------------------------------------------------------------------------------*/
// 鍵のMax数（配列の数）
#define KEY_MAX (8)

// 鍵の大きさX
#define KEY_SIZE_X (64.0f)

// 鍵の大きさY
#define KEY_SIZE_Y (64.0f)


void InitKey();

void UninitKey();

void UpdateKey();

void DrawKey();

void SetKey(float x, float y);

CollisionCircle GameKey_GetCollision(int index);

Key* GetKeys();

int GetPlayerKeyPossession();